arch/regression_results/AC20-FZK-Haus/OpenFOAM/base/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/* Butterfly 0.0.5                https://github.com/ladybug-tools/butterfly *\
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		4.0;
	format		ascii;
	class		dictionary;
	location	"system";
	object		controlDict;
}

application		buoyantSimpleFoam;

startFrom		startTime;

startTime		0;

stopAt		endTime;

endTime		5000;

deltaT		1;

writeControl		timeStep;

writeInterval		1000;

purgeWrite		5;

writeFormat		ascii;

writePrecision		9;

writeCompression		on;

timeFormat		general;

timePrecision		6;

runTimeModifiable		true;

functions
{

    MinMax
    {

        type		fieldMinMax;

        libs		( "libfieldFunctionObjects.dll" );

        fields		( p_rgh U T G qr AoA PMV PPD DR Co yPlus);

        enabled		true;

        useUserTime		false;

        region		region0;

        log		true;

        timeStart		0;

        timeEnd		25000;

        executeControl		timeStep;

        executeInterval		1;

        writeControl		timeStep;

        writeInterval		1;

    }

    volFieldValue
    {

        type		volFieldValue;

        libs		(fieldFunctionObjects);

        fields		(T U);

        operation		average;

        regionType		all;

        region		region0;

        writeFields		false;

        enabled		true;

        log		true;

        writeControl		timeStep;

        writeInterval		1;

    }

    wallHeatFlux
    {

        type		wallHeatFlux;

        libs		( "libfieldFunctionObjects.dll" );

        patches		(porousMedia_2);

        qr		qr;

        enabled		true;

        useUserTime		false;

        region		region0;

        log		true;

        timeStart		0;

        timeEnd		25000;

        executeControl		writeTime;

        executeInterval		1;

        writeControl		writeTime;

        writeInterval		1;

    }

    AoA
    {

        fvOptions
        {

            IncrementTime
            {

                scalarSemiImplicitSourceCoeffs
                {

                    injectionRateSuSp
                    {

                        AoA		(1 0);

                    }

                    volumeMode		specific;

                    selectionMode		all;

                }

                type		scalarSemiImplicitSource;

                enabled		true;

                cellZone		all;

            }

        }

        type		scalarTransport;

        libs		( "libsolverFunctionObjects.dll" );

        enabled		true;

        writeControl		writeTime;

        writeInterval		1;

        field		AoA;

        bounded01		false;

        resetOnStartUp		false;

        schemesField		AoA;

        write		true;

    }

    Co1
    {

        type		CourantNo;

        libs		(fieldFunctionObjects);

        rho		rho;

        region		region0;

        enabled		true;

        log		true;

        timeStart		0;

        timeEnd		25000;

        executeControl		writeTime;

        executeInterval		1;

        writeControl		writeTime;

        writeInterval		1;

    }

    yPlus1
    {

        type		yPlus;

        libs		(fieldFunctionObjects);

        writePrecision		8;

        writeToFile		true;

        useUserTime		true;

        region		region0;

        enabled		true;

        log		true;

        timeStart		0;

        timeEnd		25000;

        executeControl		writeTime;

        executeInterval		1;

        writeControl		writeTime;

        writeInterval		1;

    }

    solverInfo
    {

        type		solverInfo;

        libs		( "libutilityFunctionObjects.so" );

        fields		(U h);

        writeResidualFields		no;

        executeControl		timeStep;

        executeInterval		10;

    }

    comfort1
    {

        type		comfort;

        libs		( "libfieldFunctionObjects.dll" );

        clothing		0.81;

        metabolicRate		1.2;

        writeControl		writeTime;

        writeInterval		1;

    }

}