arch/regression_results/AC20-FZK-Haus/OpenFOAM/base/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/* Butterfly 0.0.5                https://github.com/ladybug-tools/butterfly *\
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		4.0;
	format		ascii;
	class		dictionary;
	location	"system";
	object		snappyHexMeshDict;
}

castellatedMesh		true;

snap		true;

addLayers		false;

geometry
{

    space_2RSCzLOBz4FAK$_wE8VckM.stl
    {

        type		triSurfaceMesh;

        name		space_2RSCzLOBz4FAK$_wE8VckM;

        regions
        {

            InnerWall_3S62uZocO66ngdmMaRS2M9
            {

                name		InnerWall_3S62uZocO66ngdmMaRS2M9;

            }

            Ceiling_14TeGe_aGDXLMTt8fX0vQP
            {

                name		Ceiling_14TeGe_aGDXLMTt8fX0vQP;

            }

            InnerWall_1zvtHpRHFWSVHgO9MXUL0M
            {

                name		InnerWall_1zvtHpRHFWSVHgO9MXUL0M;

            }

            InnerDoor_1aGihCk9trZ___gjiWxX___Jdv
            {

                name		InnerDoor_1aGihCk9trZ___gjiWxX___Jdv;

            }

            GroundFloor_2Sn7uAlFxA___POrax5b6wqo
            {

                name		GroundFloor_2Sn7uAlFxA___POrax5b6wqo;

            }

            OuterWall_3XYW9SWB7YBTXnJuv3X___K5
            {

                name		OuterWall_3XYW9SWB7YBTXnJuv3X___K5;

            }

            OuterWall_3XTF9VnRG___5_FyP6rRZVuw
            {

                name		OuterWall_3XTF9VnRG___5_FyP6rRZVuw;

            }

            Window_2CVWUzpEdesdJARzpmJYC8
            {

                name		Window_2CVWUzpEdesdJARzpmJYC8;

            }

            Window_2NviMh_1vArANYae7v_22c
            {

                name		Window_2NviMh_1vArANYae7v_22c;

            }

        }

    }

    heater0_surface.stl
    {

        type		triSurfaceMesh;

        name		heater0_surface;

        regions
        {

            heater0_surface
            {

                name		heater0_surface;

            }

        }

    }

    heater0_porous_media
    {

        type		searchableBox;

        min		(1.049999704999997 9.569999699999999 0.11999879999999798);

        max		(3.0500003130000013 9.650000300000002 0.7500001000000016);

    }

    inlet_diffuser.stl
    {

        type		triSurfaceMesh;

        name		inlet_diffuser;

        regions
        {

            inlet_diffuser
            {

                name		inlet_diffuser;

            }

        }

    }

    inlet_source_sink.stl
    {

        type		triSurfaceMesh;

        name		inlet_source_sink;

        regions
        {

            inlet_source_sink
            {

                name		inlet_source_sink;

            }

        }

    }

    inlet_refinement_small
    {

        type		searchableBox;

        min		(1.6510002693649983 6.518499791680422 2.3799998999999996);

        max		(2.4489996693650022 7.316500191680423 2.960000299999999);

    }

    inlet_refinement_large
    {

        type		searchableBox;

        min		(1.5510002693649985 6.418499791680421 2.2799998999999995);

        max		(2.5489996693650023 7.416500191680424 3.060000299999999);

    }

    outlet_diffuser.stl
    {

        type		triSurfaceMesh;

        name		outlet_diffuser;

        regions
        {

            outlet_diffuser
            {

                name		outlet_diffuser;

            }

        }

    }

    outlet_source_sink.stl
    {

        type		triSurfaceMesh;

        name		outlet_source_sink;

        regions
        {

            outlet_source_sink
            {

                name		outlet_source_sink;

            }

        }

    }

    outlet_refinement_small
    {

        type		searchableBox;

        min		(1.6510002693649983 8.37349985005542 2.3800000999999993);

        max		(2.4489996693650022 9.17150025005542 2.9600004999999987);

    }

    outlet_refinement_large
    {

        type		searchableBox;

        min		(1.5510002693649985 8.27349985005542 2.280000099999999);

        max		(2.5489996693650023 9.27150025005542 3.060000499999999);

    }

}

castellatedMeshControls
{

    maxLocalCells		1000000;

    maxGlobalCells		3000000;

    minRefinementCells		5;

    maxLoadUnbalance		0.10;

    nCellsBetweenLevels		3;

    features		();

    refinementSurfaces
    {

        space_2RSCzLOBz4FAK$_wE8VckM
        {

            level		(1 2);

            regions
            {

                InnerWall_3S62uZocO66ngdmMaRS2M9
                {

                    level		(2 3);

                    patchInfo
                    {

                        type		wall;

                    }

                }

                Ceiling_14TeGe_aGDXLMTt8fX0vQP
                {

                    level		(2 3);

                    patchInfo
                    {

                        type		wall;

                    }

                }

                InnerWall_1zvtHpRHFWSVHgO9MXUL0M
                {

                    level		(2 3);

                    patchInfo
                    {

                        type		wall;

                    }

                }

                InnerDoor_1aGihCk9trZ___gjiWxX___Jdv
                {

                    level		(2 3);

                    patchInfo
                    {

                        type		wall;

                    }

                }

                GroundFloor_2Sn7uAlFxA___POrax5b6wqo
                {

                    level		(2 3);

                    patchInfo
                    {

                        type		wall;

                    }

                }

                OuterWall_3XYW9SWB7YBTXnJuv3X___K5
                {

                    level		(2 3);

                    patchInfo
                    {

                        type		wall;

                    }

                }

                OuterWall_3XTF9VnRG___5_FyP6rRZVuw
                {

                    level		(2 3);

                    patchInfo
                    {

                        type		wall;

                    }

                }

                Window_2CVWUzpEdesdJARzpmJYC8
                {

                    level		(2 3);

                    patchInfo
                    {

                        type		wall;

                    }

                }

                Window_2NviMh_1vArANYae7v_22c
                {

                    level		(2 3);

                    patchInfo
                    {

                        type		wall;

                    }

                }

            }

        }

        heater0_surface
        {

            level		(1 2);

            regions
            {

                heater0_surface
                {

                    level		(2 3);

                    patchInfo
                    {

                        type		wall;

                    }

                }

            }

        }

        inlet_diffuser
        {

            level		(2 5);

            regions
            {

                inlet_diffuser
                {

                    level		(2 5);

                    patchInfo
                    {

                        type		wall;

                    }

                }

            }

        }

        inlet_source_sink
        {

            level		(1 2);

            regions
            {

                inlet_source_sink
                {

                    level		(2 5);

                    patchInfo
                    {

                        type		inlet;

                    }

                }

            }

        }

        null
        {

            level		(1 2);

            regions
            {

                null
                {

                    level		(1 3);

                    patchInfo
                    {

                        type		wall;

                    }

                }

            }

        }

        outlet_diffuser
        {

            level		(2 5);

            regions
            {

                outlet_diffuser
                {

                    level		(2 5);

                    patchInfo
                    {

                        type		wall;

                    }

                }

            }

        }

        outlet_source_sink
        {

            level		(1 2);

            regions
            {

                outlet_source_sink
                {

                    level		(2 5);

                    patchInfo
                    {

                        type		outlet;

                    }

                }

            }

        }

    }

    resolveFeatureAngle		60;

    refinementRegions
    {

        heater0_porous_media
        {

            mode		inside;

            levels		((0 3));

        }

        heater0_surface
        {

            mode		distance;

            levels		((0.05 3) (0.15 2));

        }

        inlet_source_sink
        {

            mode		distance;

            levels		((0.03 5) (0.08 4));

        }

        inlet_diffuser
        {

            mode		distance;

            levels		((0.03 5) (0.08 4));

        }

        outlet_source_sink
        {

            mode		distance;

            levels		((0.03 5) (0.08 4));

        }

        outlet_diffuser
        {

            mode		distance;

            levels		((0.03 5) (0.08 4));

        }

    }

    locationInMesh		(2.05 7.844999999999999 1.25);

    allowFreeStandingZoneFaces		true;

    gapMode		mixed;

    gapLevel		(3 0 7);

}

snapControls
{

    nSmoothPatch		5;

    tolerance		5.0;

    nSolveIter		50;

    nRelaxIter		15;

    nFeatureSnapIter		10;

    explicitFeatureSnap		false;

    implicitFeatureSnap		true;

    multiRegionFeatureSnap		false;

}

addLayersControls
{

    relativeSizes		true;

    layers{}

    expansionRatio		1.0;

    finalLayerThickness		0.3;

    minThickness		0.2;

    nGrow		0;

    featureAngle		110;

    nRelaxIter		3;

    nSmoothSurfaceNormals		1;

    nSmoothThickness		10;

    nSmoothNormals		3;

    maxFaceThicknessRatio		0.5;

    maxThicknessToMedialRatio		0.3;

    minMedianAxisAngle		130;

    nBufferCellsNoExtrude		0;

    nLayerIter		50;

    nRelaxedIter		20;

}

meshQualityControls
{

    maxNonOrtho		60;

    maxBoundarySkewness		20;

    maxInternalSkewness		3;

    maxConcave		80;

    minFlatness		0.5;

    minVol		1e-13;

    minTetQuality		1e-15;

    minArea		-1;

    minTwist		0.02;

    minDeterminant		0.001;

    minFaceWeight		0.02;

    minVolRatio		0.01;

    minTriangleTwist		-1;

    nSmoothScale		4;

    errorReduction		0.75;

    relaxed
    {

        maxNonOrtho		75;

    }

}

debug		0;

mergeTolerance		1E-6;